ИТ_Фирма/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЮридическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьФактическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьEMail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПочтовыйАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИТ_Фирма/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <predefined>
    <items>
      <name>EMailКонтрагента</name>
      <description>EMail контрагента</description>
    </items>
    <items>
      <name>ПочтовыйАдресКонтрагента</name>
      <description>Почтовый адрес контрагента</description>
    </items>
    <items>
      <name>ТелефонКонтрагента</name>
      <description>Телефон контрагента</description>
    </items>
    <items>
      <name>ФактическийАдресКонтрагента</name>
      <description>Фактический адрес контрагента</description>
    </items>
    <items>
      <name>ЮридическийАдресКонтрагента</name>
      <description>Юридический адрес контрагента</description>
    </items>
  </predefined>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
</mdclass:Catalog>

ИТ_Фирма/src/Catalogs/Контрагенты/ManagerModule.bsl
Процедура ЗаполнитьТабличнуюЧастьКонтактнаяИнформация() Экспорт

	ЮридическийАдресКонтрагента = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента;
	ФактическийАдресКонтрагента = Справочники.ВидыКонтактнойИнформации.ФактическийАдресКонтрагента;
	ТелефонКонтрагента = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
	EMailКонтрагента = Справочники.ВидыКонтактнойИнформации.EMailКонтрагента;
	ПочтовыйАдресКонтрагента = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента;
	
	Выборка = Справочники.Контрагенты.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		КонтрагентОбъект = Выборка.ПолучитьОбъект();
		КонтрагентОбъект.КонтактнаяИнформация.Очистить();
		
		Если ЗначениеЗаполнено(КонтрагентОбъект.УдалитьЮридическийАдрес) Тогда
			
			НоваяСтрокаТабличнойЧасти = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
			НоваяСтрокаТабличнойЧасти.Вид = ЮридическийАдресКонтрагента;
			НоваяСтрокаТабличнойЧасти.Значение = КонтрагентОбъект.УдалитьЮридическийАдрес;
			
		КонецЕсли;		
			
		Если ЗначениеЗаполнено(КонтрагентОбъект.УдалитьФактическийАдрес) Тогда
			
			НоваяСтрокаТабличнойЧасти = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
			НоваяСтрокаТабличнойЧасти.Вид = ФактическийАдресКонтрагента;
			НоваяСтрокаТабличнойЧасти.Значение = КонтрагентОбъект.УдалитьФактическийАдрес;
			
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(КонтрагентОбъект.УдалитьТелефон) Тогда
			
			НоваяСтрокаТабличнойЧасти = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
			НоваяСтрокаТабличнойЧасти.Вид = ТелефонКонтрагента;
			НоваяСтрокаТабличнойЧасти.Значение = КонтрагентОбъект.УдалитьТелефон;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КонтрагентОбъект.УдалитьEMail) Тогда
			
			НоваяСтрокаТабличнойЧасти = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
			НоваяСтрокаТабличнойЧасти.Вид = EMailКонтрагента;
			НоваяСтрокаТабличнойЧасти.Значение = КонтрагентОбъект.УдалитьEMail;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КонтрагентОбъект.УдалитьПочтовыйАдрес) Тогда
			
			НоваяСтрокаТабличнойЧасти = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
			НоваяСтрокаТабличнойЧасти.Вид = ПочтовыйАдресКонтрагента;
			НоваяСтрокаТабличнойЧасти.Значение = КонтрагентОбъект.УдалитьПочтовыйАдрес;
			
		КонецЕсли;
		

		КонтрагентОбъект.Записать();
		
	КонецЦикла;	

КонецПроцедуры
